# ExternalDataInstanceRemovedFromDocumentEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDataInstanceRemovedFromDocumentEventArgs Class
Members See Also
---
The event arguments used by the ExternalDataInstanceRemovedFrom event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class ExternalDataInstanceRemovedFromDocumentEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class ExternalDataInstanceRemovedFromDocumentEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class ExternalDataInstanceRemovedFromDocumentEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..ExternalDataInstanceRemovedFromDocumentEventArgs
# See Also
ExternalDataInstanceRemovedFromDocumentEventArgs Members
Autodesk.Revit.DB.Events Namespace